Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка.Склад КАК Склад,
	|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяСписокНоменклатуры.Количество КАК Количество,
	|	ПриходнаяНакладнаяСписокНоменклатуры.Сумма КАК Сумма,
	|	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка КАК Партия,
	|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ПриходнаяНакладнаяСписокНоменклатуры.СрокГодности
	|ПОМЕСТИТЬ втТЧ
	|ИЗ
	|	Документ.ПриходнаяНакладная.СписокНоменклатуры КАК ПриходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТЧ.Склад,
	|	втТЧ.Номенклатура,
	|	СУММА(втТЧ.Количество) КАК Количество,
	|	СУММА(втТЧ.Сумма) КАК Сумма
	|ИЗ
	|	втТЧ КАК втТЧ
	|СГРУППИРОВАТЬ ПО
	|	втТЧ.Склад,
	|	втТЧ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТЧ.Склад,
	|	втТЧ.Номенклатура,
	|	втТЧ.Количество,
	|	втТЧ.Сумма,
	|	втТЧ.Партия,
	|	втТЧ.ВидНоменклатуры,
	|	втТЧ.СрокГодности
	|ИЗ
	|	втТЧ КАК втТЧ";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();

	Если МассивРезультатов[1].Пустой() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Выборка = МассивРезультатов[1].Выбрать();

	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ПартииНоменклатуры.Записывать = Истина;

	Пока Выборка.Следующий() Цикл
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Выборка.Склад;
			Движение.Количество = Выборка.Количество;

			Движение = Движения.ПартииНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Партия = Ссылка;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.Количество;
			Движение.Сумма = Выборка.Сумма;
	КонецЦикла;
	
	Выборка = МассивРезультатов[2].Выбрать();
	
	Движения.Управленческий.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл	
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Управленческий.Товары;
		Движение.СчетКт = ПланыСчетов.Управленческий.Поставщики;
		Движение.Сумма = Выборка.Сумма;
		Движение.КоличествоДт = Выборка.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СрокГодности] = Выборка.СрокГодности;
		
		
	КонецЦикла;

КонецПроцедуры