&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ПересчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ПересчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(СтрСписка)
	СтрСписка.Сумма = СтрСписка.Цена * СтрСписка.Количество;

	Объект.СуммаПоДокументу = 0;

	Для Каждого СтрСН Из Объект.СписокНоменклатуры Цикл
		Объект.СуммаПоДокументу = Объект.СуммаПоДокументу + СтрСН.Сумма;
	КонецЦикла;

КонецПроцедуры